ALIASES = {
    "мк": "молоко коровье",
    "молоко корова": "молоко коровье",
    "молоко к": "молоко коровье",
    "корова молоко": "молоко коровье",
    "молоко коровье": "молоко коровье",
    "корова": "молоко коровье",

    "мо": "молоко овсяное",
    "овсянка": "молоко овсяное",
    "молоко овс": "молоко овсяное",
    "овес": "молоко овсяное",
    "овёс": "молоко овсяное",
    "молоко овсяное": "молоко овсяное",

    "молоко миндальное": "молоко миндальное",
    "миндаль": "молоко миндальное",
    "ммд": "молоко миндальное",
    "молоко мд": "молоко миндальное",
    "молоко миндаль": "молоко миндальное",

    "молоко кокосовое": "молоко кокосовое",
    "мкк":  "молоко кокосовое",
    "молоко кокос": "молоко кокосовое",
    "кокос": "молоко кокосовое",
    "кокосик": "молоко кокосовое",
    "молоко кк": "молоко кокосовое",

    "молоко банановое": "молоко банановое",
    "банан": "молоко банановое",
    "мбн": "молоко банановое",
    "молоко банан": "молоко банановое",

    "молоко безлактозное": "молоко безлактозное",
    "безлакт": "молоко безлактозное",
    "мбз": "молоко безлактозное",
    "молоко бз": "молоко безлактозное",
    "безлактоза": "молоко безлактозное",

    "молоко фундучное": "молоко фундучное",
    "мфд": "молоко фундучное",
    "фундук": "молоко фундучное",
    "молоко фундук": "молоко фундучное",
    "молоко фд": "молоко фундучное",

    "сливки": "сливки",
    "сливки 10%": "сливки",
    "молоко сливки": "сливки",
    "мсл": "сливки",
    "сливки 10": "сливки",

    "сливки 33%": "сливки 33%",
    "сливки 33": "сливки 33%",

    "эспрессо": "эспрессо",
    "экл": "эспрессо",
    "кофе зерно эспрессо": "эспрессо",
    
    "декаф": "декаф",
    "эдк": "декаф",
    "зерно декаф": "декаф",

    "суматра зерно": "зерно суматра",
    "зерно суматра": "зерно суматра",

    "руанда зерно": "зерно руанда",
    "зерно руанда": "зерно руанда",

    "сироп карамельный": "сироп карамельный",
    "сироп карамель": "сироп карамельный",
    "скр": "сироп карамельный",

    "сироп каштановый": "сироп каштановый",
    "сироп каштан": "сироп каштановый",
    "скш": "сироп каштановый",

    "сироп кокосовый": "сироп кокосовый",
    "сироп кокос": "сироп кокосовый",
    "сироп кокосик": "сироп кокосовый",
    "скк": "сироп кокосовый",

    "сироп ванильный": "сироп ванильный",
    "сироп ваниль": "сироп ванильный",
    "св": "сироп ванильный",

    "сироп малиновый": "сироп малиновый",
    "сироп малина": "сироп малиновый",
    "смл": "сироп малиновый",

    "сироп лайм": "сироп лайм",
    "слй": "сироп лайм",

    "сироп мятный": "сироп мятный",
    "сироп мята": "сироп мятный",
    "сироп м": "сироп мятный",
    "сироп мт": "сироп мятный",
    "смт": "сироп мятный",
    
    "сироп сливочный ликер": "сироп сливочный ликер",
    "сироп сливочный": "сироп сливочный ликер",
    "ссл": "сироп сливочный ликер",
    "сироп ликер": "сироп сливочный ликер",

    "сироп манго кордиал": "сироп манго кордиал",
    "кордиал": "сироп манго кордиал",
    "кмг": "сироп манго кордиал",

    "сироп имбирь": "сироп имбирь",
    "имбирь": "сироп имбирь",

    "стакан 0,2": "стакан 0,2",
    "стаканы 0,2": "стакан 0,2",
    "стаканы 02": "стакан 0,2",
    "стакан 2": "стакан 0,2",
    "стакан s": "стакан 0,2",

    "стакан 0,3": "стакан 0,3",
    "стакан 03": "стакан 0,3",
    "стаканы 0,3": "стакан 0,3",
    "стакан 3": "стакан 0,3",
    "стакан м": "стакан 0,3",

    "стакан 0,4": "стакан 0,4",
    "стакан 0,4 горячий": "стакан 0,4",
    "стакан 04": "стакан 0,4",
    "стакан L": "стакан 0,4",
    "стакан L горячий": "стакан 0,4",
    "стакан л": "стакан 0,4",

    "ванильный протеин": "ванильный протеин",
    "протеин ванильный": "ванильный протеин",
    "протеин": "ванильный протеин",

    "вода газированная": "вода газированная",
    "вода газ": "вода газированная",
    "вода": "вода газированная",
    "газ вода": "вода газированная",

    "джус боллы кокос": "джус боллы кокос",
    "джус боллы": "джус боллы кокос",
    "кокос боллы": "джус боллы кокос",
    "боллы кк": "джус боллы кокос",
    
    "какао порошок": "какао порошок",
    "какао 100%": "какао порошок",
    "какао без сахара": "какао порошок",
    "кбс": "какао порошок",
    "какао бс": "какао порошок",

    "концентрат кофе": "концентрат кофе",
    "коф конц": "концентрат кофе",
    "кофе концентрат": "концентрат кофе",
    "концентрат кф": "концентрат кофе",
    "концентрат": "концентрат кофе",
    "концентрат коф": "концентрат кофе",
    "к концентрат": "концентрат кофе",
    "кнц": "концентрат кофе",

    "креатин": "креатин",

    "матча зелёная": "матча зелёная",
    "матча": "матча зелёная",
    "мтч": "матча зелёная",

    "молоко протеин": "молоко протеин",
    "мпр": "молоко протеин",

    "посыпка какао": "посыпка какао",
    "какао посыпка": "посыпка какао",
    "пкк": "посыпка какао",

    "посыпка корица": "посыпка корица",
    "корица посыпка": "посыпка корица", 
    "пкр": "посыпка корица",

    "посыпка крошка печенья": "посыпка крошка печенья",
    "ппч": "посыпка крошка печенья",
    "посыпка печенька": "посыпка крошка печенья",
    "посыпка печенье": "посыпка крошка печенья",

    "посыпка малина сублимированная": "посыпка малина сублимированная",
    "посыпка малина суб": "посыпка малина сублимированная",
    "МЛН": "посыпка малина сублимированная",
    "малина суб": "посыпка малина сублимированная",
    "малина сублимированная": "посыпка малина сублимированная",

    "посыпка манго": "посыпка манго",
    "манго посыпка": "посыпка манго",
    "пмг": "посыпка манго",

    "посыпка маршмеллоу": "посыпка маршмеллоу",
    "мшм": "посыпка маршмеллоу",
    "маршмеллоу": "посыпка маршмеллоу",

    "посыпка цветочная": "посыпка цветочная",
    "цветочная посыпка": "посыпка цветочная",
    "пцв": "посыпка цветочная",

    "пюре юдзу": "пюре юдзу",
    "юдзу пюре": "пюре юдзу",
    "юдзу": "пюре юдзу",
    "пюз": "пюре юдзу",

    "сок апельсиновый мурокотовый": "сок апельсиновый муракотовый",
    "сок": "сок апельсиновый муракотовый", 
    "сок апельсин": "сок апельсиновый муракотовый", 

    "тоник": "тоник",

    "топпинг соленая карамель": "топпинг соленая карамель",
    "тск": "топпинг соленая карамель",
    "соленка": "топпинг соленая карамель",
    "солёнка": "топпинг соленая карамель",
    "соленая карамель": "топпинг соленая карамель",
    "топпинг солёная карамель": "топпинг соленая карамель",

    "цветы жасмина": "цветы жасмина",
    "жасмин": "цветы жасмина",
    "цвт жасмин": "цветы жасмина",

    "цикорий": "цикорий",

    "цитрусовый чипс": "цитрусовый чипс",
    "чипс": "цитрусовый чипс",

    "чай иван-чай с облепихой": "чай иван-чай с облепихой",
    "иван-чай": "чай иван-чай с облепихой",
    "иван чай": "чай иван-чай с облепихой",

    "чай листовой ходзича с чебрецом": "чай листовой ходзича с чебрецом",
    "чай ходзича чебрец": "чай листовой ходзича с чебрецом",
    "ходзича чебрец": "чай листовой ходзича с чебрецом",

    "чай ходзича порошок": "чай ходзича порошок",
    "ходзича": "чай ходзича порошок",
    "хдч": "чай ходзича порошок",

    "чайный концентрат жасмин": "чайный концентрат жасмин",
    "кнц жасмин": "чайный концентрат жасмин",
    "чай кнц": "чайный концентрат жасмин",
    "кнц чай": "чайный концентрат жасмин",
    "чайный кнц": "чайный концентрат жасмин",

    "какао с сахаром": "какао с сахаром",
    "ксх": "какао с сахаром",

    "манго пенка": "манго пенка",

    "мусс с бананом, клубникой и голубикой": "мусс с бананом, клубникой и голубикой",
    "мусс голубик": "мусс с бананом, клубникой и голубикой",

    "основа пряный гибискус": "основа пряный гибискус",
    "гибискус": "основа пряный гибискус",
    "основа гибискус": "основа пряный гибискус",

    "посыпка малина": "посыпка малина",
    "млн": "посыпка малина",
    "посыпка малиновая": "посыпка малина",

    "посыпка черничная": "посыпка черничная",
    "посыпка черника": "посыпка черничная",
    "пчр": "посыпка черничная",

    "сметана": "сметана",
    "смт": "посыпка черничная",

    "соус клубничный соусник": "соус клубничный соусник",
    "соус клубника": "соус клубничный соусник",
    "соус клб": "соус клубничный соусник",

    "сырная пенка": "сырная пенка",
    "сыр": "сырная пенка",
    "сыр пена": "сырная пенка",

    "фильтр руанда пф": "фильтр руанда пф",
    "руанда пф": "фильтр руанда пф",
    "руанда": "фильтр руанда пф",

    "фильтр суматра пф": "фильтр суматра пф",
    "суматра": "фильтр суматра пф",
    "суматра пф": "фильтр суматра пф",

    "двойной гриль-чиз с чеддером и ветчиной": "двойной гриль-чиз с чеддером и ветчиной",
    "гриль чиз ветчина": "двойной гриль-чиз с чеддером и ветчиной",
    "двойной гриль чиз ветчина": "двойной гриль-чиз с чеддером и ветчиной",
    "двойной гриль чиз ветчина сыр": "двойной гриль-чиз с чеддером и ветчиной",
    "дв гриль чиз ветчина": "двойной гриль-чиз с чеддером и ветчиной",
    "двойной гриль-чиз ветчина": "двойной гриль-чиз с чеддером и ветчиной",

    "баскский чизкейк с какао и фундуком": "баскский чизкейк с какао и фундуком",
    "чзк": "баскский чизкейк с какао и фундуком",
    "чизкейк нутелла": "баскский чизкейк с какао и фундуком",
    "чизкейк какао": "баскский чизкейк с какао и фундуком",

    "батончик с арахисом без добавления сахара": "батончик с арахисом без добавления сахара",
    "батончик арахис": "батончик с арахисом без добавления сахара",

    "белковый омлет с цыпленком": "белковый омлет с цыпленком",
    "омлет": "белковый омлет с цыпленком",
    "белковый омлет": "белковый омлет с цыпленком",

    "большой завтрак с хэшбрауном": "большой завтрак с хэшбрауном",
    "завтрак": "большой завтрак с хэшбрауном",
    "большой завтрак": "большой завтрак с хэшбрауном",
    "завтрак хэш": "большой завтрак с хэшбрауном",
    "завтрак х": "большой завтрак с хэшбрауном",
    "завтрак с хэшбрауном": "большой завтрак с хэшбрауном",

    "булочка с корицей": "булочка с корицей",
    "булочка корица": "булочка с корицей",
    "булочка": "булочка с корицей",
    "булочки": "булочка с корицей",

    "булочка с маком": "булочка с маком",
    "булочка мак": "булочка с маком",

    "гриль-маффин с беконом и омлетом": "гриль-маффин с беконом и омлетом",
    "маффин": "гриль-маффин с беконом и омлетом",
    "гриль маффин": "гриль-маффин с беконом и омлетом",
    "гриль-маффин": "гриль-маффин с беконом и омлетом",

    "гриль-ролл с цыпленком барбекю": "гриль-ролл с цыпленком барбекю",
    "ролл ббк": "гриль-ролл с цыпленком барбекю",
    "ролл барбекю": "гриль-ролл с цыпленком барбекю",
    "гриль ролл ббк": "гриль-ролл с цыпленком барбекю",

    "двойной гриль-чиз с тунцом": "двойной гриль-чиз с тунцом",
    "гриль чиз тунец": "двойной гриль-чиз с тунцом",
    "гриль-чиз тунец": "двойной гриль-чиз с тунцом",
    "двойной гр чиз тунец": "двойной гриль-чиз с тунцом",

    "ириска": "ириска",

    "ириска с попкорном": "ириска с попкорном",
    "ириска попкорн": "ириска с попкорном",

    "ириска с фисташкой и кардамоном": "ириска с фисташкой и кардамоном",
    "ириска фисташка": "ириска с фисташкой и кардамоном",
    "ириска с фисташкой": "ириска с фисташкой и кардамоном",

    "йогурт с голубикой и гранолой Fresco": "йогурт с голубикой и гранолой Fresco",
    "мусс гранола": "йогурт с голубикой и гранолой Fresco",
    "йогурт гранола": "йогурт с голубикой и гранолой Fresco",
    "мусс гранола голубика": "йогурт с голубикой и гранолой Fresco",

    "кекс лимонный": "кекс лимонный",
    "кекс": "кекс лимонный",
    "кекс лимон": "кекс лимонный",

    "мадлен с матчей": "мадлен с матчей",
    "мадлен матча": "мадлен с матчей",

    "орешки со сгущенкой": "орешки со сгущенкой",
    "орешки": "орешки со сгущенкой",

    "панини с омлетом и беконом": "панини с омлетом и беконом",
    "панини омлет": "панини с омлетом и беконом",
    "панини омл": "панини с омлетом и беконом",
    "панини с омлетом": "панини с омлетом и беконом",

    "панини с пастрами из говядины": "панини с пастрами из говядины",
    "панини говядина": "панини с пастрами из говядины",
    "панини с пастрами": "панини с пастрами из говядины",
    "панини пастры": "панини с пастрами из говядины",
    "панини с пастрами": "панини с пастрами из говядины",

    "панини с цыпленком и вялеными томатами": "панини с цыпленком и вялеными томатами",
    "панини цып": "панини с цыпленком и вялеными томатами",
    "панини с цыпленком": "панини с цыпленком и вялеными томатами",
    "панини цыпа": "панини с цыпленком и вялеными томатами",

    "печенье с шоколадом и фундуком": "печенье с шоколадом и фундуком",
    "печенье нутелла""печенье с шоколадом и фундуком": "печенье с шоколадом и фундуком",

    "печенье мисо": "печенье мисо",
    "мисо печенье": "печенье мисо",
    "печенье мисо-карамель": "печенье мисо",

    "пирог шоколад-вишня": "пирог шоколад-вишня",
    "пирог": "пирог шоколад-вишня",
    "пирог вишня": "пирог шоколад-вишня",
    "пирог шоколад": "пирог шоколад-вишня",
    "пирог вишня шоколад": "пирог шоколад-вишня",
    "пирог шоколад виншня": "пирог шоколад-вишня",
    "пирог вишня-шоколад": "пирог шоколад-вишня",

    "пирожное лимончелло": "пирожное лимончелло",
    "лимончелло": "пирожное лимончелло",

    "скрэмбл боул с индейкой": "скрэмбл боул с индейкой",
    "скрэмбл": "скрэмбл боул с индейкой",
    "скрэмбл с индейкой": "скрэмбл боул с индейкой",

    "сырники": "сырники",
    "сырник": "сырники",

    "сэндвич ролл с тунцом и яйцом": "сэндвич ролл с тунцом и яйцом",
    "ролл тунец": "сэндвич ролл с тунцом и яйцом",
    "ролл с тунцом": "сэндвич ролл с тунцом и яйцом",
    "ролл с тунцом": "сэндвич ролл с тунцом и яйцом",
    "ролл с тунцом и яйцо": "сэндвич ролл с тунцом и яйцом",
    "ролл тунец яйцо": "сэндвич ролл с тунцом и яйцом",

    "сэндвич ролл цезарь": "сэндвич ролл цезарь",
    "цезарь": "сэндвич ролл цезарь",
    "ролл цезарь": "сэндвич ролл цезарь",

    "трубочка с вареной сгущенкой": "трубочка с вареной сгущенкой",
    "трубочка": "трубочка с вареной сгущенкой",
    "трубочка со сгущенкой": "трубочка с вареной сгущенкой",

    "фокачча с индейкой и кремом из шпината": "фокачча с индейкой и кремом из шпината",
    "фокачча": "фокачча с индейкой и кремом из шпината",
    "фокачча шпинат": "фокачча с индейкой и кремом из шпината",

    "чизкейк с клубникой": "чизкейк с клубникой",
    "чзк клубника": "чизкейк с клубникой",
    "чизкейк клубника": "чизкейк с клубникой",

    "крышка 0,2": "крышка 0,2",
    "крышка 02": "крышка 0,2",
    "крышка 2": "крышка 0,2",
    
    "крышка 0,3": "крышка 0,3",
    "крышка 03": "крышка 0,3",
    "крышка 3": "крышка 0,3",

    "крышка 0,4": "крышка 0,4",
    "крышка 04": "крышка 0,4",
    "крышка 4": "крышка 0,4",

    "крышка для холодных": "крышка для холодных",
    "крышка холодная": "крышка для холодных",
    "холодная крышка": "крышка для холодных",

    "стакан для холодных напитков 400 мл": "стакан для холодных напитков 400 мл",
    "стакан х 0,4": "стакан для холодных напитков 400 мл",
    "стакан х 04": "стакан для холодных напитков 400 мл",
    "стакан холодный": "стакан для холодных напитков 400 мл",
    "стакан х": "стакан для холодных напитков 400 мл",
    "стакан х L": "стакан для холодных напитков 400 мл",

    "стакан для холодных напитков 600": "стакан для холодных напитков 600 мл",
    "стакан х 0,6": "стакан для холодных напитков 600 мл",
    "стакан х 06": "стакан для холодных напитков 600 мл",
    "стакан хл": "стакан для холодных напитков 600 мл",
    "стакан XL": "стакан для холодных напитков 600 мл"
}