REASONS = {

    "порча": "порча продукта",
    "порча отмена": "порча продукта",
    "порча продукта": "порча продукта",
    
    "челфак": "челфак",

    "срок": "срок",

    "нужды": "производственные нужды",
    "производственные нужды": "производственные нужды",

    "обуч": "обучение",
    "обучение": "обучение",

    "маркетинг": "маркетинг",
    "марк": "маркетинг",
    "маркет": "маркетинг",

    "порча упаковки": "порча упаковки",

    "переделка": "переделка для гостя",
    "переделка для гостя": "переделка для гостя"

}